; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	satellite6 - satellite
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	spectrograph4 - mode
	image2 - mode
	spectrograph5 - mode
	thermograph0 - mode
	spectrograph3 - mode
	image1 - mode
	Star1 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 spectrograph5)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph0)
	(supports instrument1 image2)
	(calibration_target instrument1 Star4)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph5)
	(calibration_target instrument3 Star1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star4)
	(supports instrument5 spectrograph5)
	(supports instrument5 thermograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument7 image2)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 spectrograph3)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 thermograph0)
	(supports instrument9 spectrograph5)
	(calibration_target instrument9 Star4)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
	(supports instrument10 spectrograph3)
	(supports instrument10 image2)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation3)
	(supports instrument11 image1)
	(calibration_target instrument11 Star4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon7)
	(supports instrument12 spectrograph3)
	(calibration_target instrument12 GroundStation2)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star4)
	(supports instrument13 spectrograph5)
	(calibration_target instrument13 GroundStation3)
	(supports instrument14 spectrograph3)
	(supports instrument14 spectrograph4)
	(calibration_target instrument14 Star4)
	(supports instrument15 spectrograph5)
	(supports instrument15 spectrograph3)
	(supports instrument15 spectrograph4)
	(calibration_target instrument15 GroundStation2)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(on_board instrument15 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Planet9)
)
(:goal (and
	(pointing satellite0 Planet10)
	(pointing satellite1 Star4)
	(pointing satellite2 Phenomenon8)
	(pointing satellite3 Phenomenon8)
	(have_image Phenomenon5 spectrograph5)
	(have_image Phenomenon5 spectrograph3)
	(have_image Planet6 spectrograph4)
	(have_image Phenomenon7 spectrograph5)
	(have_image Phenomenon7 image1)
	(have_image Phenomenon8 spectrograph5)
	(have_image Planet9 spectrograph4)
	(have_image Planet10 spectrograph4)
))

)

; plan
1. (turn_to satellite6 groundstation2 planet9)
   deleted: (pointing satellite6 planet9)
   added: (pointing satellite6 groundstation2)
   goals met: 0 of 12
2. (switch_on instrument15 satellite6)
   deleted: (power_avail satellite6)
   added: (power_on instrument15)
   goals met: 0 of 12
3. (calibrate satellite6 instrument15 groundstation2)
   added: (calibrated instrument15)
   goals met: 0 of 12
4. (turn_to satellite6 planet10 groundstation2)
   deleted: (pointing satellite6 groundstation2)
   added: (pointing satellite6 planet10)
   goals met: 0 of 12
5. (take_image satellite6 planet10 instrument15 spectrograph4)
   added: (have_image planet10 spectrograph4)
   goals met: 1 of 12
6. (turn_to satellite6 phenomenon5 planet10)
   deleted: (pointing satellite6 planet10)
   added: (pointing satellite6 phenomenon5)
   goals met: 1 of 12
7. (turn_to satellite2 groundstation3 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 groundstation3)
   goals met: 1 of 12
8. (turn_to satellite1 star4 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star4)
   goals met: 2 of 12
9. (turn_to satellite0 planet10 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet10)
   goals met: 3 of 12
10. (take_image satellite6 phenomenon5 instrument15 spectrograph5)
   added: (have_image phenomenon5 spectrograph5)
   goals met: 4 of 12
11. (take_image satellite6 phenomenon5 instrument15 spectrograph3)
   added: (have_image phenomenon5 spectrograph3)
   goals met: 5 of 12
12. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 5 of 12
13. (calibrate satellite2 instrument5 groundstation3)
   added: (calibrated instrument5)
   goals met: 5 of 12
14. (turn_to satellite2 phenomenon7 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 phenomenon7)
   goals met: 5 of 12
15. (take_image satellite2 phenomenon7 instrument5 image1)
   added: (have_image phenomenon7 image1)
   goals met: 6 of 12
16. (take_image satellite2 phenomenon7 instrument5 spectrograph5)
   added: (have_image phenomenon7 spectrograph5)
   goals met: 7 of 12
17. (turn_to satellite2 phenomenon8 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon8)
   goals met: 8 of 12
18. (take_image satellite2 phenomenon8 instrument5 spectrograph5)
   added: (have_image phenomenon8 spectrograph5)
   goals met: 9 of 12
19. (turn_to satellite3 phenomenon8 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 phenomenon8)
   goals met: 10 of 12
20. (turn_to satellite6 planet6 phenomenon5)
   deleted: (pointing satellite6 phenomenon5)
   added: (pointing satellite6 planet6)
   goals met: 10 of 12
21. (take_image satellite6 planet6 instrument15 spectrograph4)
   added: (have_image planet6 spectrograph4)
   goals met: 11 of 12
22. (turn_to satellite6 planet9 planet6)
   deleted: (pointing satellite6 planet6)
   added: (pointing satellite6 planet9)
   goals met: 11 of 12
23. (take_image satellite6 planet9 instrument15 spectrograph4)
   added: (have_image planet9 spectrograph4)
   goals met: 12 of 12
